import numpy as np
from BPScore import DClassifier

#这是一个API调用实例，展示了如何调用7对5分类神经网络

#-------------------------数据库实例------------------------

#这是训练集，你可以替换为.csv等数据库，注意格式正确
train_data = np.array([[10,20,23,50,49,47,55,0],
              [21,32,40,56,55,49,62,0],
              [18,24,29,55,48,60,55,0],
              [13,23,19,58,59,57,49,0],
              [53,58,60,55,12,23,24,1],
              [59,60,58,56,34,23,33,1],
              [53,58,60,55,12,23,24,1],
              [49,48,58,53,41,33,39,1],
              [61,73,66,63,92,86,87,2],
              [71,60,62,66,89,79,80,2],
              [64,66,74,61,93,90,86,2],
              [67,65,63,60,91,87,87,2],
              [91,95,82,90,65,64,66,3],
              [90,91,88,91,71,68,70,3],
              [89,86,91,79,69,65,66,3],
              [91,95,88,86,70,64,74,3],
              [96,97,97,96,95,96,97,4],
              [94,95,98,99,98,95,99,4],
              [96,97,95,96,94,98,97,4],
              [98,96,99,98,97,96,92,4]])

#这是检测集，你可以替换为.csv等数据库，注意格式正确
check_data = np.array([[10,20,23,50,49,47,55,0],
              [53,58,60,55,12,23,24,1],
              [61,73,66,63,92,86,87,2],
              [91,95,82,90,65,64,66,3],
              [98,96,99,98,97,96,92,4]])

#这是等待预测的数据
evaluate_data = np.array([[90, 91, 93, 95, 93, 99, 89]])

#-----------------------API调用实例------------------------

#如何训练模型-实例
model = DClassifier({
    "Option": "train" ,         #指定动作为训练"train"
    "Train_Data": train_data ,  #加载训练集
    "Check_Data": check_data ,  #加载检测集
    "Study_Rate": 0.02 ,        #设定学习率
    "N": 800 ,                  #设定迭代次数
    "File": r"B:\Temp\DataEvaluate.h5" ,#指定模型.h5文件与保存位置
    "Visable": True ,           #打开可视化
    "TimeOut": 5                #训练开始延时5秒
    })       
#训练完毕后，你可以在指定目录下找到.h5模型文件
#使用如下命令，查看保存时的loss值与模型准确率
print("\n训练实例_模型的loss值：", model.ID["Result"][0])
print("\n训练实例_模型的准确率：", model.ID["Result"][1])

#如何使用模型-实例
model = DClassifier({
    "Option": "evaluate" ,      #指定动作为评估"evaluate"
    "File": r"B:\Temp\DataEvaluate.h5" ,#指定已存在的.h5文件
    "Visable": False ,          #关闭可视化
    #"TimeOut": 3 ,             #因为关闭了可视化，所以不需要TimeOut参数
    "Eva_Data": evaluate_data#加载预测目标
    })
#使用如下命令，查看模型预测值
print("\n评估实例_预测的分类值：", model.ID["Result"][0])
#当然，对于批量数据，你也可以直接导出整个输出
print("\n评估实例_评估输出：", model.ID["Result"])